uhnp/src/Enums/ТипыВНА/ТипыВНА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВНА</name>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>НематериальныйАктив</name>
  </enumValues>
  <enumValues>
    <name>ИнвестиционноеИмущество</name>
  </enumValues>
  <enumValues>
    <name>НезавершенноеСтроительство</name>
  </enumValues>
  <enumValues>
    <name>БиологическийАктив</name>
  </enumValues>
  <enumValues>
    <name>ВнеоборотныйАктивДляПродажи</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ТипыВНА/ManagerModule.bsl
Функция ПолучитьПараметры() Экспорт

	Результат = Новый Соответствие;
	
	// НезавершенноеСтроительство
	ПараметрыКласса = НовыеПараметрыКласса();
	ПараметрыКласса.МодельУчетаВНА = "УчетПоФактическимЗатратам";
	ПараметрыКласса.ОграничениеПравИспользования = Истина;
	ПараметрыКласса.ПараметрыОбесценения         = Истина;
	Результат.Вставить(НезавершенноеСтроительство, ПараметрыКласса);
	
	//	БиологическийАктив
	ПараметрыКласса = НовыеПараметрыКласса();
	ПараметрыКласса.НачислятьАмортизацию         = Истина;
	ПараметрыКласса.ОграничениеПравИспользования = Истина;
	ПараметрыКласса.ПараметрыВыбытия             = Истина;
	ПараметрыКласса.ПараметрыОбесценения         = Истина;
	ПараметрыКласса.ПараметрыПереоценки          = Истина;
	Результат.Вставить(БиологическийАктив, ПараметрыКласса);

	// ВнеоборотныйАктивДляПродажи
	ПараметрыКласса = НовыеПараметрыКласса();
	ПараметрыКласса.МодельУчетаВНА   = "НеИспользовать";
	ПараметрыКласса.ПараметрыВыбытия = Истина;
	Результат.Вставить(ВнеоборотныйАктивДляПродажи, ПараметрыКласса);

	// НематериальныйАктив
	ПараметрыКласса = НовыеПараметрыКласса();
	ПараметрыКласса.НачислятьАмортизацию         = Истина;
	ПараметрыКласса.ОграничениеПравИспользования = Истина;
	ПараметрыКласса.ПараметрыВыбытия             = Истина;
	ПараметрыКласса.ПараметрыОбесценения         = Истина;
	ПараметрыКласса.ПараметрыПереоценки          = Истина;
	Результат.Вставить(НематериальныйАктив, ПараметрыКласса);

	// ИнвестиционноеИмущество
	ПараметрыКласса = НовыеПараметрыКласса();
	ПараметрыКласса.МодельУчетаВНА = "УчетПоФактическимЗатратам";
	ПараметрыКласса.ОграничениеПравИспользования = Истина;
	ПараметрыКласса.ПараметрыВыбытия             = Истина;
	Результат.Вставить(ИнвестиционноеИмущество, ПараметрыКласса);

	// ОсновноеСредство
	ПараметрыКласса = НовыеПараметрыКласса();
	ПараметрыКласса.НачислятьАмортизацию         = Истина;
	ПараметрыКласса.ОграничениеПравИспользования = Истина;
	ПараметрыКласса.ПараметрыВыбытия             = Истина;
	ПараметрыКласса.ПараметрыОбесценения         = Истина;
	ПараметрыКласса.ПараметрыПереоценки          = Истина;
	Результат.Вставить(ОсновноеСредство, ПараметрыКласса);
	
	Возврат Результат;

КонецФункции

Функция ПолучитьКлассыПоступления() Экспорт
	Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		ПредопределенноеЗначение("Перечисление.ТипыВНА.НезавершенноеСтроительство"));
КонецФункции

Функция ПолучитьКлассыЭксплуатации() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыВНА.ОсновноеСредство"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыВНА.НематериальныйАктив"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыВНА.ИнвестиционноеИмущество"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыВНА.БиологическийАктив"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыВНА.ВнеоборотныйАктивДляПродажи"));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКлассВНАПоСправочнику(СправочникМетаданные) Экспорт
	
	СоответствиеКлассовВНА = Новый Соответствие;
	СоответствиеКлассовВНА.Вставить(Метаданные.НайтиПоТипу(ВстраиваниеУХКлиентСервер.ПолучитьТипОС()),	Перечисления.ТипыВНА.ОсновноеСредство);
	СоответствиеКлассовВНА.Вставить(Метаданные.Справочники.НематериальныеАктивы, 						Перечисления.ТипыВНА.НематериальныйАктив);
	СоответствиеКлассовВНА.Вставить(Метаданные.Справочники.ОбъектыСтроительства, 						Перечисления.ТипыВНА.НезавершенноеСтроительство);
	
	Результат = СоответствиеКлассовВНА[СправочникМетаданные];
	Если Результат = Неопределено Тогда
		Результат = Перечисления.ТипыВНА.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НовыеПараметрыКласса()
	
	ПараметрыКласса = Новый Структура;
	ПараметрыКласса.Вставить("МодельУчетаВНА", "");
	ПараметрыКласса.Вставить("НачислятьАмортизацию",         Ложь);
	ПараметрыКласса.Вставить("ОграничениеПравИспользования", Ложь);
	ПараметрыКласса.Вставить("ПараметрыВыбытия",             Ложь);
	ПараметрыКласса.Вставить("ПараметрыОбесценения",         Ложь);
	ПараметрыКласса.Вставить("ПараметрыПереоценки",          Ложь);
	
	Возврат ПараметрыКласса;

КонецФункции
